[Killed] UpdateOperator
src/grounding.ts:44:29
 function rangeIntersects(lines: Set<number>, start: number, end: number): boolean {
   const lo = Math.min(start, end);
   const hi = Math.max(start, end);
-  for (let n = lo; n <= hi; n++) if (lines.has(n)) return true;
+  for (let n = lo; n <= hi; n--) if (lines.has(n)) return true;
   return false;
 }
killedBy: anchorStatus returns moved_out when the finding range does not intersect any hunk
statusReason: expected 'current' to be 'moved_out' // Object.is equality
