[Killed] BlockStatement
src/grounding.ts:24:77
 }
 
 /** Build a quick lookup of file → set of new-side line numbers covered by hunks. */
-export function buildLineIndex(diff: UnifiedDiff): Map<string, Set<number>> {
-  const idx = new Map<string, Set<number>>();
-  for (const f of diff.files) {
-    const set = new Set<number>();
-    for (const h of f.hunks) {
-      if (h.newLineNumbers && h.newLineNumbers.length > 0) {
-        for (const n of h.newLineNumbers) set.add(n);
-      } else {
-        // fall back to the hunk's declared new range
-        for (let n = h.newStart; n < h.newStart + Math.max(h.newLines, 1); n++) set.add(n);
-      }
-    }
-    idx.set(f.path, set);
-  }
-  return idx;
-}
+export function buildLineIndex(diff: UnifiedDiff): Map<string, Set<number>> {}
 
 function rangeIntersects(lines: Set<number>, start: number, end: number): boolean {
killedBy: toReviewPayload — inline comment line anchoring anchors to the in-diff line nearest end_line, not a raw end_line outside the diff
statusReason: expected [ Array(1) ] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/grounding.ts:26:31
 /** Build a quick lookup of file → set of new-side line numbers covered by hunks. */
 export function buildLineIndex(diff: UnifiedDiff): Map<string, Set<number>> {
   const idx = new Map<string, Set<number>>();
-  for (const f of diff.files) {
-    const set = new Set<number>();
-    for (const h of f.hunks) {
-      if (h.newLineNumbers && h.newLineNumbers.length > 0) {
-        for (const n of h.newLineNumbers) set.add(n);
-      } else {
-        // fall back to the hunk's declared new range
-        for (let n = h.newStart; n < h.newStart + Math.max(h.newLines, 1); n++) set.add(n);
-      }
-    }
-    idx.set(f.path, set);
-  }
+  for (const f of diff.files) {}
   return idx;
 }
killedBy: toReviewPayload — inline comment line anchoring anchors to the in-diff line nearest end_line, not a raw end_line outside the diff
statusReason: expected undefined to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/grounding.ts:28:30
   const idx = new Map<string, Set<number>>();
   for (const f of diff.files) {
     const set = new Set<number>();
-    for (const h of f.hunks) {
-      if (h.newLineNumbers && h.newLineNumbers.length > 0) {
-        for (const n of h.newLineNumbers) set.add(n);
-      } else {
-        // fall back to the hunk's declared new range
-        for (let n = h.newStart; n < h.newStart + Math.max(h.newLines, 1); n++) set.add(n);
-      }
-    }
+    for (const h of f.hunks) {}
     idx.set(f.path, set);
   }
killedBy: toReviewPayload — inline comment line anchoring anchors to the in-diff line nearest end_line, not a raw end_line outside the diff
statusReason: expected undefined to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/grounding.ts:29:60
   for (const f of diff.files) {
     const set = new Set<number>();
     for (const h of f.hunks) {
-      if (h.newLineNumbers && h.newLineNumbers.length > 0) {
-        for (const n of h.newLineNumbers) set.add(n);
-      } else {
+      if (h.newLineNumbers && h.newLineNumbers.length > 0) {} else {
         // fall back to the hunk's declared new range
         for (let n = h.newStart; n < h.newStart + Math.max(h.newLines, 1); n++) set.add(n);
killedBy: toReviewPayload — inline comment line anchoring anchors to the in-diff line nearest end_line, not a raw end_line outside the diff
statusReason: expected undefined to deeply equal [ ObjectContaining{…} ]

[Survived] ConditionalExpression
src/grounding.ts:29:11
   for (const f of diff.files) {
     const set = new Set<number>();
     for (const h of f.hunks) {
-      if (h.newLineNumbers && h.newLineNumbers.length > 0) {
+      if (true) {
         for (const n of h.newLineNumbers) set.add(n);
       } else {

[NoCoverage] BlockStatement
src/grounding.ts:31:14
     for (const h of f.hunks) {
       if (h.newLineNumbers && h.newLineNumbers.length > 0) {
         for (const n of h.newLineNumbers) set.add(n);
-      } else {
-        // fall back to the hunk's declared new range
-        for (let n = h.newStart; n < h.newStart + Math.max(h.newLines, 1); n++) set.add(n);
-      }
+      } else {}
     }
     idx.set(f.path, set);

[NoCoverage] ConditionalExpression
src/grounding.ts:33:34
         for (const n of h.newLineNumbers) set.add(n);
       } else {
         // fall back to the hunk's declared new range
-        for (let n = h.newStart; n < h.newStart + Math.max(h.newLines, 1); n++) set.add(n);
+        for (let n = h.newStart; false; n++) set.add(n);
       }
     }

[NoCoverage] MethodExpression
src/grounding.ts:33:51
         for (const n of h.newLineNumbers) set.add(n);
       } else {
         // fall back to the hunk's declared new range
-        for (let n = h.newStart; n < h.newStart + Math.max(h.newLines, 1); n++) set.add(n);
+        for (let n = h.newStart; n < h.newStart + Math.min(h.newLines, 1); n++) set.add(n);
       }
     }

[Killed] BlockStatement
src/grounding.ts:41:83
   return idx;
 }
 
-function rangeIntersects(lines: Set<number>, start: number, end: number): boolean {
-  const lo = Math.min(start, end);
-  const hi = Math.max(start, end);
-  for (let n = lo; n <= hi; n++) if (lines.has(n)) return true;
-  return false;
-}
+function rangeIntersects(lines: Set<number>, start: number, end: number): boolean {}
 
 /**
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected '0/2 passed' to be '1/2 passed' // Object.is equality

[Survived] MethodExpression
src/grounding.ts:42:14
 }
 
 function rangeIntersects(lines: Set<number>, start: number, end: number): boolean {
-  const lo = Math.min(start, end);
+  const lo = Math.max(start, end);
   const hi = Math.max(start, end);
   for (let n = lo; n <= hi; n++) if (lines.has(n)) return true;

[Survived] MethodExpression
src/grounding.ts:43:14
 
 function rangeIntersects(lines: Set<number>, start: number, end: number): boolean {
   const lo = Math.min(start, end);
-  const hi = Math.max(start, end);
+  const hi = Math.min(start, end);
   for (let n = lo; n <= hi; n++) if (lines.has(n)) return true;
   return false;

[Killed] ConditionalExpression
src/grounding.ts:44:20
 function rangeIntersects(lines: Set<number>, start: number, end: number): boolean {
   const lo = Math.min(start, end);
   const hi = Math.max(start, end);
-  for (let n = lo; n <= hi; n++) if (lines.has(n)) return true;
+  for (let n = lo; false; n++) if (lines.has(n)) return true;
   return false;
 }
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected '0/2 passed' to be '1/2 passed' // Object.is equality

[Killed] BooleanLiteral
src/grounding.ts:44:59
 function rangeIntersects(lines: Set<number>, start: number, end: number): boolean {
   const lo = Math.min(start, end);
   const hi = Math.max(start, end);
-  for (let n = lo; n <= hi; n++) if (lines.has(n)) return true;
+  for (let n = lo; n <= hi; n++) if (lines.has(n)) return false;
   return false;
 }
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected '0/2 passed' to be '1/2 passed' // Object.is equality

[Killed] BooleanLiteral
src/grounding.ts:45:10
   const lo = Math.min(start, end);
   const hi = Math.max(start, end);
   for (let n = lo; n <= hi; n++) if (lines.has(n)) return true;
-  return false;
+  return true;
 }
 
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected '2/2 passed' to be '1/2 passed' // Object.is equality

[Killed] ArrowFunction
src/grounding.ts:54:46
  */
 export function groundFindings(findings: Finding[], diff: UnifiedDiff): GroundingResult {
   const lineIndex = buildLineIndex(diff);
-  const filesInDiff = new Set(diff.files.map((f) => f.path));
+  const filesInDiff = new Set(diff.files.map(() => undefined));
   const kept: Finding[] = [];
   const dropped: { finding: Finding; reason: string }[] = [];
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected '0/2 passed' to be '1/2 passed' // Object.is equality

[Killed] BlockStatement
src/grounding.ts:58:35
   const kept: Finding[] = [];
   const dropped: { finding: Finding; reason: string }[] = [];
 
-  for (const finding of findings) {
-    const isFullFile = finding.kind ? FULL_FILE_KINDS.has(finding.kind) : false;
-
-    if (!filesInDiff.has(finding.file)) {
-      dropped.push({ finding, reason: `file '${finding.file}' not present in diff` });
-      continue;
-    }
-
-    if (isFullFile) {
-      // full-file scanners only need the file to be in the diff
-      kept.push(finding);
-      continue;
-    }
-
-    const lines = lineIndex.get(finding.file) ?? new Set<number>();
-    if (rangeIntersects(lines, finding.start_line, finding.end_line)) {
-      kept.push(finding);
-    } else {
-      dropped.push({
-        finding,
-        reason: `lines ${finding.start_line}-${finding.end_line} do not intersect any diff hunk in '${finding.file}'`,
-      });
-    }
-  }
+  for (const finding of findings) {}
 
   return { kept, dropped };
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected '0/0 passed' to be '1/2 passed' // Object.is equality

[NoCoverage] BooleanLiteral
src/grounding.ts:59:75
   const dropped: { finding: Finding; reason: string }[] = [];
 
   for (const finding of findings) {
-    const isFullFile = finding.kind ? FULL_FILE_KINDS.has(finding.kind) : false;
+    const isFullFile = finding.kind ? FULL_FILE_KINDS.has(finding.kind) : true;
 
     if (!filesInDiff.has(finding.file)) {

[Killed] BooleanLiteral
src/grounding.ts:61:9
   for (const finding of findings) {
     const isFullFile = finding.kind ? FULL_FILE_KINDS.has(finding.kind) : false;
 
-    if (!filesInDiff.has(finding.file)) {
+    if (filesInDiff.has(finding.file)) {
       dropped.push({ finding, reason: `file '${finding.file}' not present in diff` });
       continue;
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected '0/2 passed' to be '1/2 passed' // Object.is equality

[Killed] ConditionalExpression
src/grounding.ts:61:9
   for (const finding of findings) {
     const isFullFile = finding.kind ? FULL_FILE_KINDS.has(finding.kind) : false;
 
-    if (!filesInDiff.has(finding.file)) {
+    if (true) {
       dropped.push({ finding, reason: `file '${finding.file}' not present in diff` });
       continue;
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected '0/2 passed' to be '1/2 passed' // Object.is equality

[Killed] ConditionalExpression
src/grounding.ts:66:9
       continue;
     }
 
-    if (isFullFile) {
+    if (true) {
       // full-file scanners only need the file to be in the diff
       kept.push(finding);
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected '2/2 passed' to be '1/2 passed' // Object.is equality

[Survived] ConditionalExpression
src/grounding.ts:66:9
       continue;
     }
 
-    if (isFullFile) {
+    if (false) {
       // full-file scanners only need the file to be in the diff
       kept.push(finding);

[Killed] LogicalOperator
src/grounding.ts:72:19
       continue;
     }
 
-    const lines = lineIndex.get(finding.file) ?? new Set<number>();
+    const lines = lineIndex.get(finding.file) && new Set<number>();
     if (rangeIntersects(lines, finding.start_line, finding.end_line)) {
       kept.push(finding);
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected '0/2 passed' to be '1/2 passed' // Object.is equality

[Killed] ConditionalExpression
src/grounding.ts:73:9
     }
 
     const lines = lineIndex.get(finding.file) ?? new Set<number>();
-    if (rangeIntersects(lines, finding.start_line, finding.end_line)) {
+    if (false) {
       kept.push(finding);
     } else {
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected '0/2 passed' to be '1/2 passed' // Object.is equality

[Killed] ConditionalExpression
src/grounding.ts:73:9
     }
 
     const lines = lineIndex.get(finding.file) ?? new Set<number>();
-    if (rangeIntersects(lines, finding.start_line, finding.end_line)) {
+    if (true) {
       kept.push(finding);
     } else {
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected '2/2 passed' to be '1/2 passed' // Object.is equality

[Killed] BlockStatement
src/grounding.ts:75:12
     const lines = lineIndex.get(finding.file) ?? new Set<number>();
     if (rangeIntersects(lines, finding.start_line, finding.end_line)) {
       kept.push(finding);
-    } else {
-      dropped.push({
-        finding,
-        reason: `lines ${finding.start_line}-${finding.end_line} do not intersect any diff hunk in '${finding.file}'`,
-      });
-    }
+    } else {}
   }
 
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected '1/1 passed' to be '1/2 passed' // Object.is equality

[Killed] BlockStatement
src/grounding.ts:106:81
  * It NEVER returns `content_changed` — that is a content comparison the SERVER
  * layers on top (it owns the sha256 fingerprint; this function is content-blind).
  */
-export function anchorStatus(finding: Finding, diff: UnifiedDiff): AnchorStatus {
-  const filesInDiff = new Set(diff.files.map((f) => f.path));
-  if (!filesInDiff.has(finding.file)) return 'orphaned';
-  const isFullFile = finding.kind ? FULL_FILE_KINDS.has(finding.kind) : false;
-  if (isFullFile) return 'current';
-  const lines = buildLineIndex(diff).get(finding.file) ?? new Set<number>();
-  return rangeIntersects(lines, finding.start_line, finding.end_line) ? 'current' : 'moved_out';
-}
+export function anchorStatus(finding: Finding, diff: UnifiedDiff): AnchorStatus {}
 
 /**
killedBy: anchorStatus returns orphaned when the finding file is absent from the diff
statusReason: expected undefined to be 'orphaned' // Object.is equality

[Killed] ArrowFunction
src/grounding.ts:107:46
  * layers on top (it owns the sha256 fingerprint; this function is content-blind).
  */
 export function anchorStatus(finding: Finding, diff: UnifiedDiff): AnchorStatus {
-  const filesInDiff = new Set(diff.files.map((f) => f.path));
+  const filesInDiff = new Set(diff.files.map(() => undefined));
   if (!filesInDiff.has(finding.file)) return 'orphaned';
   const isFullFile = finding.kind ? FULL_FILE_KINDS.has(finding.kind) : false;
killedBy: anchorStatus returns current when the finding range intersects a hunk
statusReason: expected 'orphaned' to be 'current' // Object.is equality

[Killed] BooleanLiteral
src/grounding.ts:108:7
  */
 export function anchorStatus(finding: Finding, diff: UnifiedDiff): AnchorStatus {
   const filesInDiff = new Set(diff.files.map((f) => f.path));
-  if (!filesInDiff.has(finding.file)) return 'orphaned';
+  if (filesInDiff.has(finding.file)) return 'orphaned';
   const isFullFile = finding.kind ? FULL_FILE_KINDS.has(finding.kind) : false;
   if (isFullFile) return 'current';
killedBy: anchorStatus returns orphaned when the finding file is absent from the diff
statusReason: expected 'moved_out' to be 'orphaned' // Object.is equality

[Killed] ConditionalExpression
src/grounding.ts:108:7
  */
 export function anchorStatus(finding: Finding, diff: UnifiedDiff): AnchorStatus {
   const filesInDiff = new Set(diff.files.map((f) => f.path));
-  if (!filesInDiff.has(finding.file)) return 'orphaned';
+  if (false) return 'orphaned';
   const isFullFile = finding.kind ? FULL_FILE_KINDS.has(finding.kind) : false;
   if (isFullFile) return 'current';
killedBy: anchorStatus returns orphaned when the finding file is absent from the diff
statusReason: expected 'moved_out' to be 'orphaned' // Object.is equality

[Survived] BooleanLiteral
src/grounding.ts:109:73
 export function anchorStatus(finding: Finding, diff: UnifiedDiff): AnchorStatus {
   const filesInDiff = new Set(diff.files.map((f) => f.path));
   if (!filesInDiff.has(finding.file)) return 'orphaned';
-  const isFullFile = finding.kind ? FULL_FILE_KINDS.has(finding.kind) : false;
+  const isFullFile = finding.kind ? FULL_FILE_KINDS.has(finding.kind) : true;
   if (isFullFile) return 'current';
   const lines = buildLineIndex(diff).get(finding.file) ?? new Set<number>();

[Killed] ConditionalExpression
src/grounding.ts:110:7
   const filesInDiff = new Set(diff.files.map((f) => f.path));
   if (!filesInDiff.has(finding.file)) return 'orphaned';
   const isFullFile = finding.kind ? FULL_FILE_KINDS.has(finding.kind) : false;
-  if (isFullFile) return 'current';
+  if (false) return 'current';
   const lines = buildLineIndex(diff).get(finding.file) ?? new Set<number>();
   return rangeIntersects(lines, finding.start_line, finding.end_line) ? 'current' : 'moved_out';
killedBy: anchorStatus returns current for a secret_leak finding even when its range is outside every hunk
statusReason: expected 'moved_out' to be 'current' // Object.is equality

[Killed] ConditionalExpression
src/grounding.ts:110:7
   const filesInDiff = new Set(diff.files.map((f) => f.path));
   if (!filesInDiff.has(finding.file)) return 'orphaned';
   const isFullFile = finding.kind ? FULL_FILE_KINDS.has(finding.kind) : false;
-  if (isFullFile) return 'current';
+  if (true) return 'current';
   const lines = buildLineIndex(diff).get(finding.file) ?? new Set<number>();
   return rangeIntersects(lines, finding.start_line, finding.end_line) ? 'current' : 'moved_out';
killedBy: anchorStatus returns moved_out when the finding range does not intersect any hunk
statusReason: expected 'current' to be 'moved_out' // Object.is equality

[Killed] LogicalOperator
src/grounding.ts:111:17
   if (!filesInDiff.has(finding.file)) return 'orphaned';
   const isFullFile = finding.kind ? FULL_FILE_KINDS.has(finding.kind) : false;
   if (isFullFile) return 'current';
-  const lines = buildLineIndex(diff).get(finding.file) ?? new Set<number>();
+  const lines = buildLineIndex(diff).get(finding.file) && new Set<number>();
   return rangeIntersects(lines, finding.start_line, finding.end_line) ? 'current' : 'moved_out';
 }
killedBy: anchorStatus returns current when the finding range intersects a hunk
statusReason: expected 'moved_out' to be 'current' // Object.is equality

[Killed] BlockStatement
src/grounding.ts:130:82
  * does not line up with `newLineNumbers` (safe legacy fallback: the caller then
  * stores/compares no fingerprint, so the finding stays `current`).
  */
-export function anchoredText(finding: Finding, diff: UnifiedDiff): string | null {
-  const file = diff.files.find((f) => f.path === finding.file);
-  if (!file) return null;
-
-  // newLineNumber → raw text, gathered from every hunk that has aligned text.
-  const byLine = new Map<number, string>();
-  for (const h of file.hunks) {
-    const nums = h.newLineNumbers;
-    const text = h.newLineText;
-    // Require aligned text for THIS hunk; a mismatch/absence makes it unusable.
-    if (!text || text.length !== nums.length) return null;
-    for (let i = 0; i < nums.length; i++) byLine.set(nums[i]!, text[i]!);
-  }
-
-  const lo = Math.min(finding.start_line, finding.end_line);
-  const hi = Math.max(finding.start_line, finding.end_line);
-  const picked: string[] = [];
-  // Ascending line-number order; only lines actually present in the diff.
-  for (const n of [...byLine.keys()].sort((a, b) => a - b)) {
-    if (n < lo || n > hi) continue;
-    picked.push(byLine.get(n)!.replace(/\s+$/, ''));
-  }
-  if (picked.length === 0) return null;
-  return picked.join('\n');
-}
+export function anchoredText(finding: Finding, diff: UnifiedDiff): string | null {}
 
 /** Human-readable summary, e.g. "3/3 passed" used in run-trace stats. */
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected undefined to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Killed] ArrowFunction
src/grounding.ts:131:32
  * stores/compares no fingerprint, so the finding stays `current`).
  */
 export function anchoredText(finding: Finding, diff: UnifiedDiff): string | null {
-  const file = diff.files.find((f) => f.path === finding.file);
+  const file = diff.files.find(() => undefined);
   if (!file) return null;
 
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected null to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Killed] EqualityOperator
src/grounding.ts:131:39
  * stores/compares no fingerprint, so the finding stays `current`).
  */
 export function anchoredText(finding: Finding, diff: UnifiedDiff): string | null {
-  const file = diff.files.find((f) => f.path === finding.file);
+  const file = diff.files.find((f) => f.path !== finding.file);
   if (!file) return null;
 
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected null to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Killed] BooleanLiteral
src/grounding.ts:132:7
  */
 export function anchoredText(finding: Finding, diff: UnifiedDiff): string | null {
   const file = diff.files.find((f) => f.path === finding.file);
-  if (!file) return null;
+  if (file) return null;
 
   // newLineNumber → raw text, gathered from every hunk that has aligned text.
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected null to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Killed] ConditionalExpression
src/grounding.ts:132:7
  */
 export function anchoredText(finding: Finding, diff: UnifiedDiff): string | null {
   const file = diff.files.find((f) => f.path === finding.file);
-  if (!file) return null;
+  if (false) return null;
 
   // newLineNumber → raw text, gathered from every hunk that has aligned text.
killedBy: anchoredText returns null when the finding file is absent from the diff
statusReason: Cannot read properties of undefined (reading 'hunks')

[Killed] BlockStatement
src/grounding.ts:136:31
 
   // newLineNumber → raw text, gathered from every hunk that has aligned text.
   const byLine = new Map<number, string>();
-  for (const h of file.hunks) {
-    const nums = h.newLineNumbers;
-    const text = h.newLineText;
-    // Require aligned text for THIS hunk; a mismatch/absence makes it unusable.
-    if (!text || text.length !== nums.length) return null;
-    for (let i = 0; i < nums.length; i++) byLine.set(nums[i]!, text[i]!);
-  }
+  for (const h of file.hunks) {}
 
   const lo = Math.min(finding.start_line, finding.end_line);
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected null to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Killed] BooleanLiteral
src/grounding.ts:140:9
     const nums = h.newLineNumbers;
     const text = h.newLineText;
     // Require aligned text for THIS hunk; a mismatch/absence makes it unusable.
-    if (!text || text.length !== nums.length) return null;
+    if (text || text.length !== nums.length) return null;
     for (let i = 0; i < nums.length; i++) byLine.set(nums[i]!, text[i]!);
   }
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected null to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Killed] ConditionalExpression
src/grounding.ts:140:9
     const nums = h.newLineNumbers;
     const text = h.newLineText;
     // Require aligned text for THIS hunk; a mismatch/absence makes it unusable.
-    if (!text || text.length !== nums.length) return null;
+    if (false) return null;
     for (let i = 0; i < nums.length; i++) byLine.set(nums[i]!, text[i]!);
   }
killedBy: anchoredText returns null when the hunk has no newLineText (legacy diff)
statusReason: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/grounding.ts:141:21
     const text = h.newLineText;
     // Require aligned text for THIS hunk; a mismatch/absence makes it unusable.
     if (!text || text.length !== nums.length) return null;
-    for (let i = 0; i < nums.length; i++) byLine.set(nums[i]!, text[i]!);
+    for (let i = 0; i >= nums.length; i++) byLine.set(nums[i]!, text[i]!);
   }
 
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected null to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Killed] ConditionalExpression
src/grounding.ts:141:21
     const text = h.newLineText;
     // Require aligned text for THIS hunk; a mismatch/absence makes it unusable.
     if (!text || text.length !== nums.length) return null;
-    for (let i = 0; i < nums.length; i++) byLine.set(nums[i]!, text[i]!);
+    for (let i = 0; false; i++) byLine.set(nums[i]!, text[i]!);
   }
 
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected null to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Killed] MethodExpression
src/grounding.ts:144:14
     for (let i = 0; i < nums.length; i++) byLine.set(nums[i]!, text[i]!);
   }
 
-  const lo = Math.min(finding.start_line, finding.end_line);
+  const lo = Math.max(finding.start_line, finding.end_line);
   const hi = Math.max(finding.start_line, finding.end_line);
   const picked: string[] = [];
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected '  const c = 3;' to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Killed] MethodExpression
src/grounding.ts:145:14
   }
 
   const lo = Math.min(finding.start_line, finding.end_line);
-  const hi = Math.max(finding.start_line, finding.end_line);
+  const hi = Math.min(finding.start_line, finding.end_line);
   const picked: string[] = [];
   // Ascending line-number order; only lines actually present in the diff.
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected '  const b = 2;' to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Killed] BlockStatement
src/grounding.ts:148:61
   const hi = Math.max(finding.start_line, finding.end_line);
   const picked: string[] = [];
   // Ascending line-number order; only lines actually present in the diff.
-  for (const n of [...byLine.keys()].sort((a, b) => a - b)) {
-    if (n < lo || n > hi) continue;
-    picked.push(byLine.get(n)!.replace(/\s+$/, ''));
-  }
+  for (const n of [...byLine.keys()].sort((a, b) => a - b)) {}
   if (picked.length === 0) return null;
   return picked.join('\n');
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected null to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Survived] ArrowFunction
src/grounding.ts:148:43
   const hi = Math.max(finding.start_line, finding.end_line);
   const picked: string[] = [];
   // Ascending line-number order; only lines actually present in the diff.
-  for (const n of [...byLine.keys()].sort((a, b) => a - b)) {
+  for (const n of [...byLine.keys()].sort(() => undefined)) {
     if (n < lo || n > hi) continue;
     picked.push(byLine.get(n)!.replace(/\s+$/, ''));

[Killed] EqualityOperator
src/grounding.ts:149:9
   const picked: string[] = [];
   // Ascending line-number order; only lines actually present in the diff.
   for (const n of [...byLine.keys()].sort((a, b) => a - b)) {
-    if (n < lo || n > hi) continue;
+    if (n >= lo || n > hi) continue;
     picked.push(byLine.get(n)!.replace(/\s+$/, ''));
   }
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected '  const a = 1;' to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Killed] LogicalOperator
src/grounding.ts:149:9
   const picked: string[] = [];
   // Ascending line-number order; only lines actually present in the diff.
   for (const n of [...byLine.keys()].sort((a, b) => a - b)) {
-    if (n < lo || n > hi) continue;
+    if (n < lo && n > hi) continue;
     picked.push(byLine.get(n)!.replace(/\s+$/, ''));
   }
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected '  const a = 1;\n  const b = 2;\n  con…' to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Killed] Regex
src/grounding.ts:150:40
   // Ascending line-number order; only lines actually present in the diff.
   for (const n of [...byLine.keys()].sort((a, b) => a - b)) {
     if (n < lo || n > hi) continue;
-    picked.push(byLine.get(n)!.replace(/\s+$/, ''));
+    picked.push(byLine.get(n)!.replace(/\s$/, ''));
   }
   if (picked.length === 0) return null;
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected '  const b = 2;  \n  const c = 3;' to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Killed] EqualityOperator
src/grounding.ts:152:7
     if (n < lo || n > hi) continue;
     picked.push(byLine.get(n)!.replace(/\s+$/, ''));
   }
-  if (picked.length === 0) return null;
+  if (picked.length !== 0) return null;
   return picked.join('\n');
 }
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected null to be '  const b = 2;\n  const c = 3;' // Object.is equality
