[Killed] ConditionalExpression
src/grounding.ts:152:7
     if (n < lo || n > hi) continue;
     picked.push(byLine.get(n)!.replace(/\s+$/, ''));
   }
-  if (picked.length === 0) return null;
+  if (false) return null;
   return picked.join('\n');
 }
killedBy: anchoredText returns null when the range covers no parsed line
statusReason: expected '' to be null

[Killed] StringLiteral
src/grounding.ts:153:22
     picked.push(byLine.get(n)!.replace(/\s+$/, ''));
   }
   if (picked.length === 0) return null;
-  return picked.join('\n');
+  return picked.join("");
 }
 
killedBy: anchoredText extracts only the covered lines, in ascending line-number order
statusReason: expected '  const b = 2;  const c = 3;' to be '  const b = 2;\n  const c = 3;' // Object.is equality

[Killed] BlockStatement
src/grounding.ts:157:67
 }
 
 /** Human-readable summary, e.g. "3/3 passed" used in run-trace stats. */
-export function groundingSummary(result: GroundingResult): string {
-  const total = result.kept.length + result.dropped.length;
-  return `${result.kept.length}/${total} passed`;
-}
+export function groundingSummary(result: GroundingResult): string {}
 
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected undefined to be '1/2 passed' // Object.is equality

[Killed] ArithmeticOperator
src/grounding.ts:158:17
 
 /** Human-readable summary, e.g. "3/3 passed" used in run-trace stats. */
 export function groundingSummary(result: GroundingResult): string {
-  const total = result.kept.length + result.dropped.length;
+  const total = result.kept.length - result.dropped.length;
   return `${result.kept.length}/${total} passed`;
 }
killedBy: reviewPullRequest (engine) single-pass: assembles, grounds, drops the hallucinated finding
statusReason: expected '1/0 passed' to be '1/2 passed' // Object.is equality
